---
title: ProjectPosition
classe: Autodesk.Revit.DB.ProjectPosition
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ProjectPosition

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Angle { get; set; }` | `projectPosition.Angle` | Double |
| `Double EastWest { get; set; }` | `projectPosition.EastWest` | Double |
| `Double Elevation { get; set; }` | `projectPosition.Elevation` | Double |
| `Boolean IsValidObject { get; }` | `projectPosition.IsValidObject` | Boolean |
| `Double NorthSouth { get; set; }` | `projectPosition.NorthSouth` | Double |
| `Void Dispose()` | `projectPosition.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```